tests/stress/stress-login.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 5
      rampTo: 20
      name: "Rampa de 5 a 20 usuarios/s durante 20s"
    - duration: 20
      arrivalRate: 20
      name: "Pico de 20 login/s durante 20s"
  cookie: {}
  defaults:
    headers:
      Accept: "text/html"
      User-Agent: "Artillery-Stress-Test"
scenarios:
  - name: "Login + Dashboard"
    flow:
      - post:
          url: "/admin/login"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          body: "username=admin&password=admin123"
      - think: 1
      - get:
          url: "/admin/dashboard"
      - think: 2
      - get:
          url: "/admin/logout"