tests/stress/stress-prestamo.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 2
      rampTo: 10
      name: "Rampa de 2 a 10 usuarios/s durante 30s (flujo completo)"
  cookie: {}
  defaults:
    headers:
      Accept: "text/html"
      User-Agent: "Artillery-Stress-Test"
scenarios:
  - name: "Registro de préstamo (login + API + registrar)"
    flow:
      - post:
          url: "/admin/login"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          body: "username=admin&password=admin123"
      - think: 1
      - get:
          url: "/admin/prestamos"
      - think: 1
      - get:
          url: "/admin/dashboard"
      - think: 1
      - get:
          url: "/admin/materiales"